### 📖 Terraform Plan (infra-pe/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.cgn_pe_apim.azurerm_subnet.cgn_pe_apim_subnet will be created
  + resource "azurerm_subnet" "cgn_pe_apim_subnet" {
      + address_prefixes                              = [
          + "10.26.3.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "io-p-cgn-pe-apim-snet-01"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "io-p-itn-cgn-pe-vnet-01"
      + service_endpoints                             = [
          + "Microsoft.Web",
        ]
      + virtual_network_name                          = "io-p-itn-cgn-pe-rg-01"

      + delegation {
          + name = "default"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_endpoint.this will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "this" {
      + cdn_frontdoor_profile_id = (known after apply)
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-frontend-assets-fde-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_origin.this will be created
  + resource "azurerm_cdn_frontdoor_origin" "this" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = false
      + enabled                        = true
      + host_name                      = "iopitncgnpeassetsst01.z38.web.core.windows.net"
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "io-p-itn-cgn-pe-frontend-assets-fdo-01"
      + origin_host_header             = "iopitncgnpeassetsst01.z38.web.core.windows.net"
      + priority                       = 1
      + weight                         = 1000
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_origin_group.this will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "this" {
      + cdn_frontdoor_profile_id                                  = (known after apply)
      + id                                                        = (known after apply)
      + name                                                      = "io-p-itn-cgn-pe-frontend-assets-fdog-01"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = true

      + health_probe {
          + interval_in_seconds = 100
          + path                = "/"
          + protocol            = "Https"
          + request_type        = "HEAD"
        }

      + load_balancing {
          + additional_latency_in_milliseconds = 50
          + sample_size                        = 4
          + successful_samples_required        = 3
        }
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_route.this will be created
  + resource "azurerm_cdn_frontdoor_route" "this" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + cdn_frontdoor_rule_set_ids    = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "HttpsOnly"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "io-p-itn-cgn-pe-frontend-assets-cdnr-01"
      + patterns_to_match             = [
          + "/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]

      + cache {
          + compression_enabled           = false
          + query_string_caching_behavior = "IgnoreQueryString"
        }
    }

  # module.app_service_onboarding_portal_backend.module.app_service_onboarding_portal_backend.data.azurerm_private_dns_zone.app_service will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_private_dns_zone" "app_service" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azurewebsites.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-itn-cgn-pe-rg-01"
    }

  # module.app_service_onboarding_portal_backend.module.app_service_onboarding_portal_backend.data.azurerm_virtual_network.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_virtual_network" "this" {
      + address_space           = (known after apply)
      + dns_servers             = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = (known after apply)
      + name                    = "io-p-itn-cgn-pe-vnet-01"
      + resource_group_name     = "io-p-itn-cgn-pe-rg-01"
      + subnets                 = (known after apply)
      + tags                    = (known after apply)
      + vnet_peerings           = (known after apply)
      + vnet_peerings_addresses = (known after apply)
    }

  # module.app_service_onboarding_portal_backend.module.app_service_onboarding_portal_backend.azurerm_private_endpoint.app_service_sites will be updated in-place
  ~ resource "azurerm_private_endpoint" "app_service_sites" {
        id                            = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-pe-backend-app-pep-01"
        name                          = "io-p-itn-cgn-pe-backend-app-pep-01"
        tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_app_service"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "1.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

      ~ private_dns_zone_group {
            id                   = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-pe-backend-app-pep-01/privateDnsZoneGroups/private-dns-zone-group"
            name                 = "private-dns-zone-group"
          ~ private_dns_zone_ids = [
              - "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ] -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.app_service_onboarding_portal_backend.module.app_service_onboarding_portal_backend.azurerm_private_endpoint.staging_app_service_sites[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "staging_app_service_sites" {
        id                            = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-pe-backend-staging-app-pep-01"
        name                          = "io-p-itn-cgn-pe-backend-staging-app-pep-01"
        tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_app_service"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "1.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

      ~ private_dns_zone_group {
            id                   = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-pe-backend-staging-app-pep-01/privateDnsZoneGroups/private-dns-zone-group"
            name                 = "private-dns-zone-group"
          ~ private_dns_zone_ids = [
              - "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ] -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.cgn_pe_apim.module.apim.azurerm_api_management.this will be created
  + resource "azurerm_api_management" "this" {
      + client_certificate_enabled    = false
      + developer_portal_url          = (known after apply)
      + gateway_disabled              = false
      + gateway_regional_url          = (known after apply)
      + gateway_url                   = (known after apply)
      + id                            = (known after apply)
      + location                      = "italynorth"
      + management_api_url            = (known after apply)
      + min_api_version               = "2021-08-01"
      + name                          = "io-p-itn-cgn-pe-apim-01"
      + notification_sender_email     = (known after apply)
      + portal_url                    = (known after apply)
      + private_ip_addresses          = (known after apply)
      + public_ip_addresses           = (known after apply)
      + public_network_access_enabled = false
      + publisher_email               = "io-operations@pagopa.it"
      + publisher_name                = "PagoPa CGN Onboarding Portal"
      + resource_group_name           = "io-p-itn-cgn-pe-rg-01"
      + scm_url                       = (known after apply)
      + sku_name                      = "Standard_1"
      + tags                          = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.2.2"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + virtual_network_type          = "Internal"

      + delegation (known after apply)

      + hostname_configuration (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + protocols (known after apply)

      + security (known after apply)

      + sign_in (known after apply)

      + sign_up {
          + enabled = false

          + terms_of_service {
              + consent_required = false
              + enabled          = false
            }
        }

      + tenant_access (known after apply)

      + virtual_network_configuration {
          + subnet_id = (known after apply)
        }
    }

  # module.cgn_pe_apim.module.apim.azurerm_network_security_group.nsg_apim will be created
  + resource "azurerm_network_security_group" "nsg_apim" {
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-cgn-pe-apim-nsg-01"
      + resource_group_name = "io-p-itn-cgn-pe-rg-01"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = "Access to Azure Key Vault for core service functionality"
              + destination_address_prefix                 = "AzureKeyVault"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "azure-keyvault"
              + priority                                   = 202
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Access to Azure SQL endpoints for core service functionality"
              + destination_address_prefix                 = "SQL"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "1433"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "sql"
              + priority                                   = 201
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Azure Infrastructure Load Balancer"
              + destination_address_prefix                 = "VirtualNetwork"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "6390"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "azure-load-balancer"
              + priority                                   = 201
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "AzureLoadBalancer"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Dependency on Azure Storage for core service functionality"
              + destination_address_prefix                 = "Storage"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "storage"
              + priority                                   = 200
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Management endpoint for Azure portal and PowerShell"
              + destination_address_prefix                 = "VirtualNetwork"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "3443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "apim-management"
              + priority                                   = 200
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "ApiManagement"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Publish Diagnostics Logs and Metrics, Resource Health, and Application Insights"
              + destination_address_prefix                 = "AzureMonitor"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_ranges                    = [
                  + "1886",
                  + "443",
                ]
              + direction                                  = "Outbound"
              + name                                       = "azure-monitor"
              + priority                                   = 203
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ]
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.2.2"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_azure_api_net will be created
  + resource "azurerm_private_dns_a_record" "apim_azure_api_net" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "io-p-itn-cgn-pe-apim-01"
      + records             = (known after apply)
      + resource_group_name = "io-p-itn-cgn-pe-rg-01"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.2.2"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + ttl                 = 3600
      + zone_name           = "azure-api.net"
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_management_azure_api_net will be created
  + resource "azurerm_private_dns_a_record" "apim_management_azure_api_net" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "io-p-itn-cgn-pe-apim-01"
      + records             = (known after apply)
      + resource_group_name = "io-p-itn-cgn-pe-rg-01"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.2.2"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + ttl                 = 3600
      + zone_name           = "management.azure-api.net"
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_scm_azure_api_net will be created
  + resource "azurerm_private_dns_a_record" "apim_scm_azure_api_net" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "io-p-itn-cgn-pe-apim-01"
      + records             = (known after apply)
      + resource_group_name = "io-p-itn-cgn-pe-rg-01"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.2.2"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + ttl                 = 3600
      + zone_name           = "scm.azure-api.net"
    }

  # module.cgn_pe_apim.module.apim.azurerm_subnet_network_security_group_association.snet_nsg will be created
  + resource "azurerm_subnet_network_security_group_association" "snet_nsg" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.cgn_pe_fe.module.cgn_pe_cdn.azurerm_cdn_frontdoor_endpoint.this will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "this" {
      + cdn_frontdoor_profile_id = (known after apply)
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-frontend-fde-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_cdn"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.0"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
    }

  # module.cgn_pe_fe.module.cgn_pe_cdn.azurerm_cdn_frontdoor_origin.this["website"] will be created
  + resource "azurerm_cdn_frontdoor_origin" "this" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + host_name                      = "iopitncgnpefest01.z38.web.core.windows.net"
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "io-p-itn-cgn-pe-frontend-website-fdo-01"
      + origin_host_header             = "iopitncgnpefest01.z38.web.core.windows.net"
      + priority                       = 1
      + weight                         = 1000
    }

  # module.cgn_pe_fe.module.cgn_pe_cdn.azurerm_cdn_frontdoor_origin_group.this will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "this" {
      + cdn_frontdoor_profile_id                                  = (known after apply)
      + id                                                        = (known after apply)
      + name                                                      = "io-p-itn-cgn-pe-frontend-fdog-01"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = true

      + health_probe {
          + interval_in_seconds = 100
          + path                = "/"
          + protocol            = "Https"
          + request_type        = "HEAD"
        }

      + load_balancing {
          + additional_latency_in_milliseconds = 50
          + sample_size                        = 4
          + successful_samples_required        = 3
        }
    }

  # module.cgn_pe_fe.module.cgn_pe_cdn.azurerm_cdn_frontdoor_profile.this will be created
  + resource "azurerm_cdn_frontdoor_profile" "this" {
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-frontend-afd-01"
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + resource_guid            = (known after apply)
      + response_timeout_seconds = 120
      + sku_name                 = "Standard_AzureFrontDoor"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_cdn"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.0"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.cgn_pe_fe.module.cgn_pe_cdn.azurerm_cdn_frontdoor_route.this will be created
  + resource "azurerm_cdn_frontdoor_route" "this" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + cdn_frontdoor_rule_set_ids    = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "HttpsOnly"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "io-p-itn-cgn-pe-frontend-cdnr-01"
      + patterns_to_match             = [
          + "/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]

      + cache {
          + compression_enabled           = false
          + query_string_caching_behavior = "IgnoreQueryString"
        }
    }

  # module.cgn_pe_fe.module.cgn_pe_cdn.azurerm_cdn_frontdoor_rule_set.this will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "this" {
      + cdn_frontdoor_profile_id = (known after apply)
      + id                       = (known after apply)
      + name                     = "ruleset"
    }

  # module.networking.module.vnet_common.azurerm_virtual_network.this will be updated in-place
  ~ resource "azurerm_virtual_network" "this" {
        id                             = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-cgn-pe-vnet-01"
        name                           = "io-p-itn-cgn-pe-vnet-01"
      + private_endpoint_vnet_policies = "Disabled"
        tags                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.postgresql_db.module.postgresql_db.azurerm_postgresql_flexible_server.this will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "this" {
        id                            = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.DBforPostgreSQL/flexibleServers/io-p-itn-cgn-pe-postgresql-psql-01"
        name                          = "io-p-itn-cgn-pe-postgresql-psql-01"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_postgres_server"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "1.0.5" -> "1.0.7"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.postgresql_db.module.postgresql_db.azurerm_private_endpoint.postgre_pep[0] will be updated in-place
  # (moved from module.postgresql_db.module.postgresql_db.azurerm_private_endpoint.postgre_pep)
  ~ resource "azurerm_private_endpoint" "postgre_pep" {
        id                            = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-pe-postgresql-psql-pep-01"
        name                          = "io-p-itn-cgn-pe-postgresql-psql-pep-01"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_postgres_server"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "1.0.5" -> "1.0.7"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 17 to add, 5 to change, 0 to destroy.
```

</details>
